import 'package:flutter/material.dart';
import 'package:marketplace_line_oa/src/constants/alva_styles.dart';
import 'package:marketplace_line_oa/src/constants/mkp_styles.dart';
import 'package:marketplace_line_oa/src/constants/my_constants.dart';
import 'package:marketplace_line_oa/src/presentation/widget/term_and_con/term_and_con_paragraph.dart';
import 'package:url_launcher/url_launcher.dart';

class TermAndConSection extends StatelessWidget {
  const TermAndConSection({super.key});

  @override
  Widget build(BuildContext context) {
    final maxWidth = MediaQuery.of(context).size.width;

    return Column(crossAxisAlignment: CrossAxisAlignment.start, children: [
      TermAndConParagraph(
          header: "บทนำ",
          text:
              "ขอต้อนรับทุกท่านสู่ อีมาร์เก็ตเพลส ของธนาคารกรุงศรีอยุธยา จำกัด มหาชน (ต่อไปนี้เรียกว่า “พร้อมบาย”)  สื่อกลางและช่องทางในการสั่งซื้อสินค้าและบริการ กรุณาอ่าน และปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้งาน เพื่อประโยชน์ของตัวท่านเอง"
              "เพื่อให้เป็นไปตามกฎหมาย ท่านยืนยันว่าท่านมีอายุยี่สิบ (20) ปีขึ้นไป หากท่านมีอายุต่ำกว่ายี่สิบ (20) ปี ท่านรับทราบว่าท่านจะต้องได้รับอนุญาตจากบิดามารดาหรือผู้ปกครองของท่านในการใช้บริการของเรา และบิดามารดาหรือผู้ปกครองตามกฎหมายดังกล่าว ต้องเห็นด้วยกับข้อกำหนดของข้อตกลงนี้ หากท่านไม่เข้าใจหรือมีข้อสงสัยความในข้อนี้ โปรดอย่าใช้งาน พร้อมบาย จนกว่าจะได้ขอความช่วยเหลือหรือขอคำแนะนำจากบิดามารดาหรือผู้ปกครองตามกฎหมายแล้ว หากท่านคือบิดามารดาหรือผู้ปกครองตามกฎหมายของผู้เยาว์ที่กำลังใช้งาน ท่านจะต้องยอมรับข้อกำหนดของข้อตกลงนี้แทนผู้เยาว์และท่านจะต้องรับผิดชอบต่อการใช้งาน พร้อมบาย ดังกล่าว"),
      TermAndConParagraph(
          header: "หน้าที่ของ พร้อมบาย",
          text:
              "พร้อมบาย ทำหน้าที่เป็นตัวกลางในการซื้อขายสินค้าหรือบริการระหว่างผู้ซื้อและผู้ขาย โดยอำนวยความสะดวกในการให้ข้อมูลและเชื่อมต่อไปยังผู้ให้บริการรับชำระเงิน"
              " เนื่องจาก พร้อมบาย เป็นตัวกลางในการซื้อขายระหว่างผู้ซื้อและผู้ขาย ดังนั้นการรับประกันสินค้าหรือบริการนั้นเป็นหน้าที่ความรับผิดชอบของพันธมิตรผู้ขายส่วนการบริการรับชำระเงินเป็นหน้าที่ความรับผิดชอบของผู้ให้บริการรับชำระเงิน"),
      TermAndConParagraph(
          header: "ข้อมูลต่าง ๆ ในเนื้อหา ความเป็นเจ้าของ และข้อจำกัดการใช้เว็บไซต์นี้",
          text:
              "ข้อมูลและข่าวสารที่อยู่ใน พร้อมบาย นี้ รวมถึง รูปภาพ รูปวาด รูปแบบ ภาพถ่าย คลิปหนัง-ภาพยนตร์ ข้อความ และเนื้อความสาระอื่น ๆ ที่ปรากฏในนี้ (เรียกรวมกันทั้งหมดในที่นี้ว่า 'เนื้อหาสาระ') เป็นลิขสิทธิ์ เครื่องหมายการค้า และทรัพย์สินทางปัญญาอื่น ๆ ถูกควบคุมและถือสิทธิ์โดยกรุงศรี ออโต้"),
      TermAndConParagraph(
          header: "การเชื่อมโยงกับเว็บไซต์อื่น",
          text:
              "ทางกรุงศรี ออโต้ ขอแจ้งให้ทุกท่านทราบว่า เนื่องจาก พร้อมบาย มีการเชื่อมต่อไปยังเว็บไซต์หรือแพลตฟอร์มของผู้ให้บริการอื่น กรุงศรี ออโต้ จะไม่รับผิดชอบ\n\n สำหรับนโยบายคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์หรือแพลตฟอร์มอื่น และกรุงศรี ออโต้ ขอแนะนำให้ทุกท่าน ระมัดระวังเมื่อออกจาก พร้อมบาย  และโปรดอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์แต่ละเว็บไซต์และทุกเว็บไซต์ซึ่งมีการรวบรวมข้อมูลส่วนบุคคล โดยท่านสามารถอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคลของกรุงศรี ออโต้ได้ที่"),
      TermAndConParagraph(
          header: "การสั่งซื้อสินค้าและบริการ",
          text:
              "จะถือว่าสมบูรณ์เมื่อท่านได้ชำระเงินค่าสินค้าและบริการครบถ้วนตามที่แจ้งไว้เรียบร้อย และยอมรับข้อกำหนดและเงื่อนไขแล้ว ทั้งนี้ในส่วนราคาและรายการส่งเสริมการขายที่นำเสนอขายจะใช้ได้เฉพาะการซื้อสินค้าผ่าน พร้อมบาย นี้เท่านั้น ไม่สามารถนำไปใช้กับการซื้อสินค้าผ่านช่องทางอื่นของกรุงศรี ออโต้ได้\n\n"
              "เมื่อการขายและสั่งซื้อสินค้าสำเร็จ จะดำเนินการจัดส่งสินค้าให้แก่ท่าน (ตามเงื่อนไขการจัดส่งของพันธมิตร กรุงศรี ออโต้ ที่แสดงในรายละเอียดของหน้าสินค้า)"
              "การซื้อสินค้าหรือบริการ พันธมิตรผู้ขายจะเป็นผู้ให้การรับประกันคุณภาพสินค้าโดยตรง กรณีอยู่ภายใต้เงื่อนไขการรับประกันท่านสามารถติดต่อพันธมิตรผู้ขายได้โดยตรง"),
      TermAndConParagraph(
          header: "การชำระเงินค่าสินค้าและบริการ สามารถทำได้ในช่องทางดังต่อไปนี้",
          text:
              "ท่านสามารถชำระค่าสินค้าและบริการที่สั่งซื้อจาก พร้อมบาย ผ่านบัตรเครดิต เดบิต ออนไลน์ ระบบจะทำการตรวจสอบการชำระเงินของท่านโดยอัตโนมัติ และอนุมัติการซื้อสินค้าพร้อมกับแจ้งไปยังพันธมิตรผู้ขายเพื่อทำการส่งสินค้าหรือบริการเมื่อการชำระเงินเสร็จสมบูรณ์เท่านั้น \n\nบัตรเครดิต Visa / Master Card / JCB / บัตรเดบิต : ระบบจะทำการเชื่อมต่อ ไปที่หน้ารับชำระเงินของผู้ให้บริการรับชำระ เพื่อให้ท่านกรอกข้อมูลบัตรเครดิต/เดบิตของท่าน \n\nโปรแกรมผ่อนชำระ : ท่านสามารถเลือกโปรแกรมผ่อนชำระตามที่ระบุบนหน้า พร้อมบาย ระบบจะนำท่านไปยังหน้ารับชำระเงินของผู้ให้บริการรับชำระ"),
      TermAndConParagraph(
          header: "นโยบายข้อมูลส่วนบุคคลด้านการเงิน",
          text:
              "การรักษาความลับของข้อมูลด้านการเงินส่วนบุคคล เป็นเรื่องที่สำคัญอย่างยิ่งต่อกรุงศรี ออโต้ เช่นเดียวกับข้อมูลส่วนบุคคลทั้งหมด ดังนั้นข้อมูลด้านการเงินส่วนบุคคลสามารถเรียกดูได้จากผู้ให้บริการทางการเงินที่เกี่ยวข้องเท่านั้น กล่าวคือ กรุงศรี ออโต้ จะไม่สามารถค้นหาข้อมูลซึ่งเกี่ยวกับข้อมูลด้านการเงินส่วนบุคคลได้เลย นอกจากนี้ ถือเป็นนโยบายที่สำคัญยิ่งสำหรับกรุงศรี ออโต้ ที่จะไม่ให้เช่าหรือขายข้อมูลด้านการเงินส่วนบุคคลของท่าน ให้กับบุคคลหรือองค์กรอื่นใด"),
      TermAndConParagraph(
          header: "การยกเลิกอันเกิดจากความผิดพลาด",
          text:
              "กรุงศรี ออโต้ มีสิทธิอย่างเต็มที่ที่จะยกเลิกคำสั่งซื้อได้ทุกเมื่อ หากความผิดพลาดนั้นเกิดมาจากความผิดพลาดในการพิมพ์หรือความผิดพลาดที่มิได้มีการคาดการณ์ไว้ล่วงหน้า อันเป็นผลมาจากสินค้าในเว็บไซต์ที่มีการลงรายการไว้ไม่ถูกต้อง (ไม่ว่าจะเป็นการลงราคาผิด หรือ ลงรายละเอียดที่ผิด เป็นต้น) ในกรณีที่รายการสั่งซื้อนั้นเกิดการยกเลิกขึ้นและได้ชำระเงินสำหรับคำสั่งซื้อนั้นเสร็จสมบูรณ์เรียบร้อยแล้ว กรุงศรี ออโต้ จะประสานงานไปยังพันธมิตรผู้ขายของกรุงศรี ออโต้เพื่อทำการคืนเงินให้ท่านเต็มจำนวนราคาสินค้า"),
      TermAndConParagraph(
          header: "ข้อจำกัดความรับผิด",
          text:
              "ท่านเข้าใจอย่างชัดเจนและได้ตกลงดังนี้ : ข้อความ และสาระสำคัญใน พร้อมบาย อาจมีความไม่ถูกต้อง ในส่วนของเนื้อหาสาระ และคำสะกด การเชื่อถือข่าวสารดังกล่าวอยู่ในส่วนความรับผิดชอบของตัวท่านเอง ขอสงวนสิทธิ์ในการแก้ไขข้อผิดพลาดหรือความไม่ครบถ้วนต่าง ๆ ในเว็บไซต์นี้ไม่ว่าจะเป็นเนื้อหาสาระ รายละเอียดและข้อมูลสินค้า โปรแกรมการบริการ และราคาที่ได้แสดงไว้ใน พร้อมบาย นี้ อาจมีการเปลี่ยนแปลงโดยไม่แจ้งให้ทราบล่วงหน้า \n\nการสั่งซื้อสินค้าและบริการหรือการกระทำรายการใด ๆ ที่เกิดขึ้นบน พร้อมบาย ไม่ว่าจะเป็นการกระทำด้วยตัวของท่านเอง หรือการที่ท่านมอบหมายให้ผู้หนึ่งผู้ใดมาใช้ในการสั่งซื้อสินค้าและบริการหรือกระทำรายการใด ๆ ไม่ว่าจะเป็นไปโดยความตั้งใจของท่าน หรือเกิดจากความประมาทเลินเล่อของท่าน ให้ถือว่าการกระทำดังกล่าวถูกต้องสมบูรณ์ หากมีความเสียหายใด ๆ เกิดขึ้น ไม่ว่าจะด้วยเหตุใดก็ตาม ท่านต้องรับผิดชอบในการกระทำดังกล่าวทั้งหมดทุกประการ โดยไม่มีข้อโต้แย้งหรือข้อเรียกร้องใด ๆ เพื่อให้กรุงศรี ออโต้ต้องรับผิดชอบชดใช้ค่าเสียหายแทนท่านแต่ประการใด \n\nภายใต้ข้อตกลงและเงื่อนไขในการใช้บริการบน พร้อมบาย นี้ หากท่านนำบัตรเครดิตของผู้อื่นมาทำรายการชำระค่าสินค้าหรือค่าบริการต่าง ๆ โดยที่ท่านไม่ได้รับอนุญาตจากเจ้าของบัตรเครดิต รวมถึงการชำระค่าสินค้าหรือค่าบริการที่ไม่ถูกต้องหรือไม่ตรง หรือไม่เป็นไปตามเจตนาที่แท้จริงของเจ้าของบัตรเครดิต เมื่อกรุงศรี ออโต้ ได้รับการโต้แย้งจากเจ้าของบัตรเครดิต หรือจากธนาคารผู้ออกบัตรเครดิต ทำให้บริษัทไม่ได้รับชำระค่าสินค้าหรือค่าบริการ หรือไม่สามารถเรียกเก็บเงินค่าใช้บริการจากเจ้าของบัตรเครดิต หรือจากธนาคารผู้ออกบัตรเครดิตได้ ท่านในฐานะผู้ใช้บริการ จะต้องรับผิดชอบค่าสินค้าหรือค่าบริการ และค่าเสียหายต่าง ๆ ที่เกิดขึ้นทุกประการ และกรุงศรี ออโต้มีสิทธิในการดำเนินคดีตามกฎหมายกับท่านต่อไป \n\nกรุงศรี ออโต้ ขอสงวนสิทธิ์ในการแก้ไขเปลี่ยนแปลงข้อตกลง และเงื่อนไขดังกล่าวข้างต้นได้ตลอดระยะเวลาการให้บริการ การที่ท่านยังคงใช้ พร้อมบาย นี้หลังจากมีการเปลี่ยนแปลงข้อตกลง และเงื่อนไขดังกล่าวแล้ว กรุงศรี ออโต้ ถือว่าท่านได้ยอมรับการเปลี่ยนแปลงดังกล่าวแล้ว"),
      TermAndConParagraph(
          header: "การชดเชยค่าเสียหาย",
          text:
              "ท่านยอมรับที่จะชดเชยค่าเสียหาย และค่าใช้จ่ายอันเกิดจากการละเมิดเงื่อนไข อันเนื่องมาจากการละเลยไม่ใส่ใจหรือการกระทำที่ผิดกฎหมาย และท่านจะไม่ให้ กรุงศรี ออโต้ (พนักงาน ผู้บริหาร บริษัทในเครือ บริษัทร่วมทุนตลอดจนหุ้นส่วนทางกฎหมาย) ต้องรับผิดชอบต่อการเรียกร้องค่าเสียหายรวมถึงค่าใช้จ่ายของทนายความที่เกิดขึ้นด้วย"),
      TermAndConParagraph(
          header: "การคืนและการยกเลิกคำสั่งซื้อ",
          text:
              "คำสั่งซื้อสามารถทำการยกเลิกได้ภายใน 7 วัน นับตั้งแต่วันที่ทำรายการสั่งซื้อสำเร็จ โดยท่านต้องติดต่อกับพันธมิตรผู้ขายโดยตรงเพื่อทำการยกเลิก และแสดงหลักฐานในการสั่งซื้อกับพันธมิตรผู้ขายและการชำระเงิน กรุงศรี ออโต้จะพยายามรักษาผลประโยชน์ให้กับผู้ท่านอย่างสูงสุด ภายใต้ข้อจำกัดที่กรุงศรี ออโต้มี"),
      Container(
        color: Colors.white,
        width: maxWidth,
        padding: const EdgeInsets.all(16.0),
        child: GestureDetector(
          key: const Key("about_us_button"),
          onTap: () {
            launchUrl(Uri.parse("https://www.krungsriauto.com/auto/About-Us/Privacy_Notice.html"));
            // AmplitudeWebHelper.getInstance().logTapOnPrivacyButtonTermAndConPage();
          },
          child: Text(
            HomeConst().privacyPolicy,
            style: AlvaStyles().headingSize12w500(BlueFantasy).copyWith(
                  height: 20 / 12,
                  decoration: TextDecoration.underline,
                ),
          ),
        ),
      ),
      Container(
        color: Colors.white,
        width: maxWidth,
        height: 16,
      )
    ]);
  }
}
