import 'package:flutter/material.dart';
import 'package:marketplace_line_oa/src/constants/alva_styles.dart';
import 'package:marketplace_line_oa/src/constants/mkp_styles.dart';
import 'package:marketplace_line_oa/src/constants/my_constants.dart';
import 'package:marketplace_line_oa/src/presentation/widget/term_and_con/term_and_con_paragraph.dart';
import 'package:url_launcher/url_launcher.dart';

class TermAndConSection extends StatelessWidget {
  const TermAndConSection({super.key});

  @override
  Widget build(BuildContext context) {
    final maxWidth = MediaQuery.of(context).size.width;

    return Column(crossAxisAlignment: CrossAxisAlignment.start, children: [
      TermAndConParagraph(
          header: "บทนำ",
          text:
              "ขอต้อนรับทุกท่านสู่ อีมาร์เก็ตเพลส ของธนาคารกรุงศรีอยุธยา จำกัด มหาชน (ต่อไปนี้เรียกว่า “กรุงศรี ออโต้”) สื่อกลางในการสั่งซื้อ ผลิตภัณฑ์และบริการ กรุณาอ่าน และปฏิบัติตามข้อกำหนดและเงื่อนไข การใช้งาน เพื่อประโยชน์ของตัวท่านเอง เพื่อให้เป็นไปตามกฎหมาย ท่านยืนยันว่าท่านมีอายุยี่สิบ (20) ปีขึ้นไป หากท่านมีอายุต่ำกว่ายี่สิบ (20) ปี ท่านรับทราบว่าท่านจะต้องได้รับอนุญาตจากบิดามารดาหรือ ผู้ปกครองของท่านในการใช้บริการของเรา และบิดามารดาหรือ ผู้ปกครองตามกฎหมายดังกล่าวต้องเห็นด้วยกับข้อกำหนดของ ข้อตกลงนี้ หากท่านไม่เข้าใจหรือมีข้อสงสัยความในข้อนี้ โปรดอย่าใช้ งานอีมาร์เก็ตเพลส จนกว่าจะได้ขอความช่วยเหลือหรือขอคำแนะนำ จากบิดามารดาหรือผู้ปกครองตามกฎหมายแล้ว หากท่านคือบิดา มารดาหรือผู้ปกครองตามกฎหมายของผู้เยาว์ที่กำลังใช้งาน ท่านจะ ต้องยอมรับข้อกำหนดของข้อตกลงนี้แทนผู้เยาว์และท่านจะต้อง รับผิดชอบต่อการใช้งานอีมาร์เก็ตเพลส ดังกล่าว"),
      TermAndConParagraph(
          header: "หน้าที่ของ อีมาร์เก็ตเพลส",
          text:
              "อีมาร์เก็ตเพลส ของกรุงศรี ออโต้ ทำหน้าที่เป็นตัวกลางในการซื้อขาย ผลิตภัณฑ์ระหว่างผู้ซื้อและผู้ขาย โดยอำนวยความสะดวกในการให้ ข้อมูลและเชื่อมต่อไปยังผู้ให้บริการรับชำระเงิน เนื่องจาก อีมาร์เก็ตเพลส ของกรุงศรี ออโต้ เป็นตัวกลางในการซื้อขายระว่าง ผู้ซื้อและผู้ขาย ดังนั้นการรับประกันผลิตภัณฑ์หรือบริการนั้นเป็นหน้าที่ ความรับผิดชอบของพันธมิตรของกรุงศรี ออโต้ ส่วนการบริการ รับชำระเงินเป็นหน้าที่ความรับผิดชอบของผู้ให้บริการรับชำระเงิน"),
      TermAndConParagraph(
          header: "ข้อมูลต่าง ๆ ในเนื้อหา ความเป็นเจ้าของ และข้อจำกัดการใช้เว็บไซต์นี้",
          text:
              "ข้อมูลและข่าวสารที่อยู่ในอีมาร์เก็ตเพลส นี้ รวมถึง รูปภาพ รูปวาด รูปแบบ ภาพถ่าย คลิปหนัง-ภาพยนตร์ ข้อความ และเนื้อความสาระอื่นๆ ที่ปรากฏในนี้ (เรียกรวมกันทั้งหมดในที่นี้ว่า 'เนื้อหาสาระ') เป็นลิขสิทธิ์ เครื่องหมายการค้า และทรัพย์สินทางปัญญาอื่นๆ ถูกควบคุมและ ถือสิทธิ์โดยกรุงศรี ออโต้"),
      TermAndConParagraph(
          header: "การเชื่อมโยงกับเว็บไซต์อื่น",
          text:
              "ทางกรุงศรี ออโต้ ขอแจ้งให้ทุกท่านทราบว่า เนื่องจากอีมาร์เก็ตเพลส ของกรุงศรี ออโต้ มีการเชื่อมต่อไปยังเว็บไซต์หรือแพลตฟอร์มของผู้ให้ บริการอื่น กรุงศรี ออโต้ จะไม่รับผิดชอบ \n\nสำหรับนโยบายคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์หรือแพลตฟอร์มอื่น และกรุงศรี ออโต้ ขอแนะนำให้ทุกท่านระมัดระวังเมื่อออกจาก อีมาร์เก็ตเพลส และโปรดอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคล ของเว็บไซต์แต่ละเว็บไซต์ และทุกเว็บไซต์ซึ่งมีการรวบรวมข้อมูลส่วน บุคคล (https://www.krungsriauto.com/auto/privacy-notice-th)"),
      TermAndConParagraph(
          header: "การสั่งซื้อผลิตภัณฑ์และบริการ",
          text:
              "จะถือว่าสมบูรณ์เมื่อท่านได้ชำระเงินค่าผลิตภัณฑ์และบริการครบถ้วน ตามที่แจ้งไว้เรียบร้อย และยอมรับข้อกำหนดและเงื่อนไขแล้ว ทั้งนี้ในส่วน ราคาและรายการส่งเสริมการขายที่นำเสนอขายจะใช้ได้เฉพาะการซื้อ ผลิตภัณฑ์ผ่านอีมาร์เก็ตเพลส นี้เท่านั้น ไม่สามารถนำไปใช้กับการซื้อ ผลิตภัณฑ์ผ่านช่องทางอื่นของกรุงศรี ออโต้ได้ \n\nเมื่อการขายและสั่งซื้อผลิตภัณฑ์สำเร็จ จะดำเนินการจัดส่งผลิตภัณฑ์ ให้แก่ท่าน (ตามเงื่อนไขการจัดส่งของพันธมิตร กรุงศรี ออโต้ ที่แสดง ในรายละเอียดของหน้าผลิตภัณฑ์) การซื้อผลิตภัณฑ์หรือบริการ พันธมิตรของกรุงศรี ออโต้ จะเป็นผู้ให้การรับประกันคุณภาพผลิตภัณฑ์ โดยตรง กรณีอยู่ภายใต้เงื่อนไขการรับประกัน ท่านสามารถติดต่อ พันธมิตรของกรุงศรี ออโต้ ได้โดยตรง"),
      TermAndConParagraph(
          header: "การชำระเงินค่าผลิตภัณฑ์และบริการ สามารถทำได้ใน ช่องทางดังต่อไปนี้",
          text:
              "ท่านสามารถชำระค่าผลิตภัณฑ์และบริการที่สั่งซื้อจากอีมาร์เก็ตเพลส ผ่านบัตรเครดิต เดบิต ออนไลน์ ระบบจะทำการตรวจสอบการชำระเงิน ของท่านโดยอัตโนมัติ และอนุมัติการซื้อผลิตภัณฑ์พร้อมกับแจ้งไปยัง พันธมิตรร้านค้าเพื่อทำการส่งผลิตภัณฑ์หรือบริการเมื่อการชำระเงิน เสร็จสมบูรณ์เท่านั้น \n\nบัตรเครดิต Visa / Master Card / JCB / บัตรเดบิต : ระบบจะทำการ เชื่อมต่อ ไปที่หน้ารับชำระเงินของผู้ให้บริการรับชำระ เพื่อให้ท่านกรอก ข้อมูลบัตรเครดิต/เดบิตของท่าน \n\nโปรแกรมผ่อนชำระ : ท่านสามารถเลือกโปรแกรมผ่อนชำระตามที่ระบุ บนหน้าอีมาร์เก็ตเพลส ระบบจะนำท่านไปยังหน้ารับชำระเงินของผู้ให้ บริการรับชำระ"),
      TermAndConParagraph(
          header: "นโยบายข้อมูลส่วนบุคคลด้านการเงิน",
          text:
              "การรักษาความลับของข้อมูลด้านการเงินส่วนบุคคล เป็นเรื่องที่สำคัญ อย่างยิ่งต่อกรุงศรี ออโต้ เช่นเดียวกับข้อมูลส่วนบุคคลทั้งหมด ดังนั้น ข้อมูลด้านการเงินส่วนบุคคลสามารถเรียกดูได้จากผู้ให้บริการทางการเงินที่เกี่ยวข้องเท่านั้น กล่าวคือ กรุงศรี ออโต้ จะไม่สามารถค้นหาข้อมูล ซึ่งเกี่ยวกับข้อมูลด้านการเงินส่วนบุคคลได้เลย นอกจากนี้ ถือเป็น นโยบายที่สำคัญยิ่งสำหรับกรุงศรี ออโต้ ที่จะไม่ให้เช่าหรือขายข้อมูล ด้านการเงินส่วนบุคคลของท่าน ให้กับบุคคลหรือองค์กรอื่นใด"),
      TermAndConParagraph(
          header: "การยกเลิกอันเกิดจากความผิดพลาด",
          text:
              "กรุงศรี ออโต้ มีสิทธิอย่างเต็มที่ที่จะยกเลิกคำสั่งซื้อได้ทุกเมื่อ หาก ความผิดพลาดนั้นเกิดมาจากความผิดพลาดในการพิมพ์หรือความ ผิดพลาดที่มิได้มีการคาดการณ์ไว้ล่วงหน้า อันเป็นผลมาจาก ผลิตภัณฑ์ในเว็บไซต์ที่มีการลงรายการไว้ไม่ถูกต้อง (ไม่ว่าจะเป็นการ ลงราคาผิด หรือ ลงรายละเอียดที่ผิด เป็นต้น) ในกรณีที่รายการสั่งซื้อ นั้นเกิดการยกเลิกขึ้นและได้ชำระเงินสำหรับคำสั่งซื้อนั้นเสร็จสมบูรณ์ เรียบร้อยแล้ว กรุงศรี ออโต้ จะประสานงานไปยังพันธมิตรของ กรุงศรี ออโต้ เพื่อทำการคืนเงินให้ท่านเต็มจำนวนราคาผลิตภัณฑ์"),
      TermAndConParagraph(
          header: "ข้อจำกัดความรับผิด",
          text:
              "ท่านเข้าใจอย่างชัดเจนและได้ตกลงดังนี้ : ข้อความ และสาระสำคัญใน อีมาร์เก็ตเพลส อาจมีความไม่ถูกต้อง ในส่วนของเนื้อหาสาระและ คำสะกด การเชื่อถือข่าวสารดังกล่าวอยู่ในส่วนความรับผิดชอบของ ตัวท่านเอง ขอสงวนสิทธิ์ในการแก้ไขข้อผิดพลาดหรือความไม่ครบถ้วน ต่าง ๆ ในเว็บไซต์นี้ไม่ว่าจะเป็นเนื้อหาสาระรายละเอียดและข้อมูล ผลิตภัณฑ์ โปรแกรมการบริการ และราคาที่ได้แสดงไว้ใน อีมาร์เก็ตเพลส นี้ อาจมีการเปลี่ยนแปลงโดยไม่แจ้งให้ทราบล่วงหน้า \n\nการสั่งซื้อผลิตภัณฑ์และบริการหรือการกระทำรายการใด ๆ ที่เกิดขึ้น บน อีมาร์เก็ตเพลส ของ กรุงศรี ออโต้ ไม่ว่าจะเป็นการกระทำด้วยตัว ของท่านเอง หรือการที่ท่านมอบหมายให้ผู้หนึ่งผู้ใดมาใช้ในการสั่งซื้อ ผลิตภัณฑ์และบริการหรือกระทำรายการใด ๆ ไม่ว่าจะเป็นไปโดยความ ตั้งใจของท่าน หรือเกิดจากความประมาทเลินเล่อของท่าน ให้ถือว่า การกระทำดังกล่าวถูกต้องสมบูรณ์ หากมีความเสียหายใด ๆ เกิดขึ้น ไม่ว่าจะด้วยเหตุใดก็ตาม ท่านต้องรับผิดชอบในการกระทำดังกล่าว ทั้งหมดทุกประการ โดยไม่มีข้อโต้แย้งหรือข้อเรียกร้องใด ๆ เพื่อให้ กรุงศรี ออโต้ต้องรับผิดชอบชดใช้ค่าเสียหายแทนท่านแต่ประการใด \n\nภายใต้ข้อตกลงและเงื่อนไขในการใช้บริการบนอีมาร์เก็ตเพลส นี้ หาก ท่านนำบัตรเครดิตของผู้อื่นมาทำรายการชำระค่าผลิตภัณฑ์หรือค่า บริการต่าง ๆ โดยที่ท่านไม่ได้รับอนุญาตจากเจ้าของบัตรเครดิต รวมถึงการชำระค่าผลิตภัณฑ์หรือค่าบริการที่ไม่ถูกต้องหรือไม่ตรง หรือไม่เป็นไปตามเจตนาที่แท้จริงของเจ้าของบัตรเครดิต เมื่อ กรุงศรี ออโต้ ได้รับการโต้แย้งจากเจ้าของบัตรเครดิต หรือจาก ธนาคารผู้ออกบัตรเครดิต ทำให้บริษัทไม่ได้รับชำระค่าผลิตภัณฑ์หรือ ค่าบริการหรือไม่สามารถเรียกเก็บเงินค่าใช้บริการจากเจ้าของ บัตรเครดิต หรือจากธนาคารผู้ออกบัตรเครดิตได้ ท่านในฐานะผู้ใช้ บริการ จะต้องรับผิดชอบค่าผลิตภัณฑ์หรือค่าบริการ และค่าเสียหาย ต่าง ๆ ที่เกิดขึ้นทุกประการ และกรุงศรี ออโต้ มีสิทธิในการดำเนินคดี ตามกฎหมายกับท่านต่อไป \n\nกรุงศรี ออโต้ ขอสงวนสิทธิ์ในการแก้ไขเปลี่ยนแปลงข้อตกลง และ เงื่อนไขดังกล่าวข้างต้นได้ตลอดระยะเวลาการให้บริการ การที่ท่านยัง คงใช้ อีมาร์เก็ตเพลส นี้หลังจากมีการเปลี่ยนแปลงข้อตกลง และ เงื่อนไขดังกล่าวแล้ว กรุงศรี ออโต้ ถือว่าท่านได้ยอมรับการ เปลี่ยนแปลงดังกล่าวแล้ว"),
      TermAndConParagraph(
          header: "การชดเชยค่าเสียหาย",
          text:
              "ท่านยอมรับที่จะชดเชยค่าเสียหาย และค่าใช้จ่ายอันเกิดจากการละเมิด เงื่อนไข อันเนื่องมาจากการละเลยไม่ใส่ใจหรือการกระทำที่ผิดกฎหมาย และท่านจะไม่ให้ กรุงศรี ออโต้ (พนักงาน ผู้บริหาร บริษัทในเครือ บริษัท ร่วมทุนตลอดจนหุ้นส่วนทางกฎหมาย) ต้องรับผิดชอบต่อการ เรียกร้องค่าเสียหายรวมถึงค่าใช้จ่ายของทนายความที่เกิดขึ้นด้วย"),
      TermAndConParagraph(
          header: "การคืนและการยกเลิกคำสั่งซื้อ",
          text:
              "คำสั่งซื้อสามารถทำการยกเลิกได้ภายใน 7 วัน นับตั้งแต่วันที่ทำ รายการสั่งซื้อสำเร็จ โดยท่านต้องติดต่อกับร้านค้าพันธมิตรโดยตรง เพื่อทำการยกเลิก และแสดงหลักฐานในการสั่งซื้อกับพันธมิตรและการ ชำระเงิน กรุงศรี ออโต้จะพยายามรักษาผลประโยชน์ให้กับผู้ท่านอย่าง สูงสุด ภายใต้ข้อจำกัดที่กรุงศรี ออโต้มี"),
      Container(
        color: Colors.white,
        width: maxWidth,
        padding: const EdgeInsets.all(16.0),
        child: GestureDetector(
          key: const Key("about_us_button"),
          onTap: () => launchUrl(Uri.parse("https://www.krungsriauto.com/auto/About-Us/Privacy_Notice.html")),
          child: Text(
            HomeConst().privacyPolicy,
            style: AlvaStyles().headingSize12w500(BlueFantasy).copyWith(
                  height: 20 / 12,
                  decoration: TextDecoration.underline,
                ),
          ),
        ),
      ),
      Container(
        color: Colors.white,
        width: maxWidth,
        height: 16,
      )
    ]);
  }
}
